Repository: jmichault/gramps-dok
Catalog: _locale/*/001-debut.md.po
Languages: eo

source: Présentation
eo: Prezento

source: Schémas simplifiés des données
eo: Simpligitaj datumaj diagramoj

source: Avant de rentrer dans gramps, il est important de comprendre comment sont organisées les données.
eo: Antaŭ ol eniri Gramps, gravas kompreni kiel la datumoj estas organizitaj.

source: L'univers familial
eo: La familia universo

source: Les trois objets essentiels qui vont vous permettre de construire votre arbre sont : * l'individu : la base de votre généalogie. * la famille :
eo: La tri esencaj objektoj, kiuj permesos al vi konstrui vian arbon, estas: * la individuo: la bazo de via genealogio. * la familio :

source: une famille dans gramps est constituée de un ou deux individus \(classiquement le mari et la femme, mais gramps autorise toutes les combinaisons\), et d'enfants. Elle va permettre de construire l'arbre. * l'évènement :
eo: Familio en Gramps konsistas el unu aŭ du individuoj \(konvencie la edzo kaj la virino, sed Gramps rajtigas ĉiujn kombinaĵojn\), kaj infanojn. Ĝi permesos konstrui la arbon. * la evento:

source: un évènement est constitué principalement d'un type, d'une date \(ou une pèriode\), et d'une description.
eo: okazaĵo konsistas ĉefe el tipo, dato \(aŭ pèriodo\), kaj priskribo.

source: Par exemple la naissance, la déclaration de naissance, le décès, le mariage, la profession vont être saisis dans un évènement. L'évènement peut être référencé par des individus et/ou des familles.
eo: Ekzemple naskiĝo, deklaro de naskiĝo, morto, geedzeco, la profesio estos kaptita en evento. La evento povas esti referencita de individuoj kaj/aŭ familioj.

source: <div class="mermaid"> erDiagram Famille ||--o| Individu : "Mari/conjoint" Famille ||--o| Individu : "Femme/conjoint" Famille ||--o{ Individu : "Enfants" Famille ||--o{ "Évènements" : participe Individu ||--o{ "Évènements" : participe Individu{ Nom Nom_Principal liste_de_Nom Noms_Alternatifs } Famille{ Texte Type } "Évènements"{ Texte Type Date Date_de_l_evenement Texte Description Lieu lieu_de_l_evenement }
eo: <div class="mermaid"> erDiagram Familio ||--o| Individuo: "Edzo/edzo" Familio ||--o| Individuo: "Virino/edzo" Familio ||--o{ Individuo: "Infanoj" Familio ||--o{ "Okazaĵoj": participo Individuo ||--o{ "Okazaĵoj": participo Individuo{ Nomo Cxefa_Nomo Nomlisto Alternativaj_Nomoj } Familio{ Teksto Tipo } "Okazaĵoj"{ Teksto Tipo Dato Event_date Tekste Priskribo Loko loko_de_la_okazajxo }

source: L'univers des sources
eo: La universo de fontoj

source: Sourcer votre généalogie est essentiel pour sa validation.
eo: Fontaĵi vian genealogion estas esenca por ĝia validigo.

source: Vous disposez de trois objets pour gérer les sources : * la citation :
eo: Vi havas tri objektojn por administri la fontojn: * la citaĵo:

source: C'est l'élément le plus fin des sources, celui qui va être référencé par l'individu, la famille, l'évènement, le lieu, le média.
eo: Ĉi tiu estas la plej bona elemento de fontoj, tiu, kiu estos referencita de la individuo, la familio, la evento, la loko, la aŭdvidaĵo.

source: Par exemple ça va être l'acte de naissance trouvé dans un registre, un paragraphe dans un livre ou une revue… La citation est reliée à une source. * la source :
eo: Ekzemple ĝi estos la naskiĝtesto trovita en registro, alineo en libro aŭ revuo ... La citaĵo estas ligita al fonto. * la fonto :

source: La source est le support dans lequel vous puisez vos citations.
eo: La fonto estas la medio el kiu vi ĉerpas viajn citaĵojn.

source: Ça peut être un registre, un microfilm, un livre… La source est localisée dans un ou plusieurs dépôts. * les dépôts :
eo: Ĝi povas esti registro, mikrofilmo, libro ... La fonto situas en unu aŭ pluraj kuŝejoj. * la deponejoj:

source: Le dépôt permet de regrouper les sources.
eo: La deponejo ebligas grupigi la fontojn.

source: Ça peut être une archive départementale, un site internet, votre coffre-fort …
eo: Ĝi povas esti faka arkivo, retejo, via monŝranko...

source: Une source peut se trouver dans plusieurs dépôts.
eo: Fonto troveblas en pluraj deponejoj.

source: Malheureusement, la hiérarchie des sources s'arrête là. On aurait pu souhaiter qu'un dépôt fasse partie d'un autre dépôt, mais gramps ne le prend pas en charge actuellement. <div class="mermaid"> erDiagram Citation ||--o| Source : dans Source ||--o{ "Dépôt" : "conservée dans (type de support, cote)" Citation{ Date date_de_l_evenement Volume_Page emplacement_dans_la_source niveau niveau_de_confiance } Source{ Texte Titre Texte Auteurs Texte Infos_publication Texte Abbreviation } "Dépôt"{ Texte Nom Texte Type Adresse Adresse liste_de_liens Liens_internet } </div>
eo: Bedaŭrinde, la hierarkio de fontoj finiĝas tie. Oni eble volas, ke deponejo estu parto de alia deponejo, sed gramps ne subtenas ĉi tion. <div class="mermaid"> erDiagram "Cita&jcirc;o" ||--o| Fonto: en Fonto ||--o{ "Deponejo": "konservita en (subtena tipo, takso)" "Cita&jcirc;o"{ Dato dato_de_okazajxo Volumo_Pagxo loko_en_fonto nivelo konfido_nivelo } Fonto{ Teksto Titolo Teksto Auxtoroj Teksto Publikigo_info Teksto Mallongigo } "Deponejo"{ Teksto Nomo Teksto Tipo Adreso Adreso listo_de_ligiloj Interretaj_ligiloj } </div>

source: Les objets annexes
eo: Aneksitaj objektoj

source: Enfin quatre objets pour enrichir vos données : * le média :
eo: Fine kvar objektoj por riĉigi viajn datumojn: * la aŭdvidaĵo:

source: Permet d'intégrer un fichier dans l'arbre. Ça peut être une image, une vidéo, un PDF, ou n'importe quoi d'autre.
eo: Permesas al vi integri dosieron en la arbon. Ĝi povas esti bildo, video, PDF aŭ io alia.

source: On va pouvoir le relier à des individus, des familles, des évènements, des citations ou des lieux. * la note :
eo: Ni povos ligi ĝin al individuoj, familioj, eventoj, citaĵoj aŭ lokoj. * la noto :

source: Constituée d'un titre et d'un texte\(multiligne et formatable\).
eo: formita de titolo kaj teksto\(multiligna kaj formatinda\).

source: Fort Utile ! Peut être reliée à n'importe quel objet ou référence d'objet. Permet de renseigner le contenu des documents, de saisir des pistes de recherche et bien d'autres choses. Une note peut être reliée à plusieurs objets. * le lieu :
eo: Tre utila! Povas esti ligita al iu ajn objekto aŭ objektoreferenco. Permesas al vi enigi la enhavon de dokumentoj, enigi serĉajn kondukojn kaj multajn aliajn aferojn. Noto povas esti ligita al pluraj objektoj. * loko:

source: Pour ne pas ressaisir n fois la même chose, éviter les erreurs de recopie, localiser précisément les lieux où se sont produits vos évènements.
eo: Por ne re -enigi la samon, evitu kopii erarojn, specife lokalizi la lokojn, kie okazis viaj eventoj.

source: Les lieux peuvent s'emboîter les uns dans les autres \(exemple : pays --> département --> commune --> hameau\).
eo: La lokoj povas kuniĝi unu en la alia \(Ekzemplo: lando-> fako-> municipo-> vilaĝeto\).

source: Avant de commencer à saisir les lieux, vous devriez bien réfléchir à votre manière d'organiser les lieux, et au greffon qui vous permettra de les gérer. * l'étiquette Elles sont gérables par le menu «Édition»-->«Étiquette» Sur chaque objet vous pouvez mettre des étiquettes.
eo: Antaŭ ol vi komencas eniri lokojn, vi devas zorge pripensi kiel vi organizas la lokojn, kaj kiu kromaĵo permesos al vi administri ilin. * la etikedo Ili povas esti administritaj per la menuo "Redaktu" --> "Etikedo". Vi povas meti etikedojn sur ĉiu objekto.

source: Une étiquette est un texte court, auquel est associé une couleur.
eo: Etikedo estas mallonga teksto, kun kiu oni asocias koloron.

source: Les étiquettes peuvent être utilisées : * pour filtrer * pour mettre en évidence dans les listes ou dans la vue graphique, grâce à la couleur.
eo: La etikedoj povas esti uzataj: * por filtri * por reliefigi en la listoj aŭ en la grafika vido, danke al la koloro.

source: le schéma complet
eo: la kompleta diagramo

source: Si vous souhaitez aller davantage dans le détail, le schéma de la base de données gramps peut être consulté ici : <https://gramps-project.org/wiki/index.php/Gramps_Data_Model>
eo: Se vi volas iri pli detale, la diagramo de la datumbazo Gramps povas esti konsultita ĉi tie: <https://gramps-project.org/wiki/index.php/Gramps_Data_model>

source: Premières saisies
eo: Unuaj Kaptiloj

source: créer un individu
eo: krei individuon

source: ajouter un évènement à un individu
eo: aldonu eventon al individuo

source: ajouter les parents
eo: aldonu gepatrojn

source: ajouter un conjoint
eo: aldonu edzinon

source: ajouter un enfant
eo: aldonu infanon

source: ajouter une citation
eo: aldonu Citaĵon

source: Aller plus loin
eo: Iru plie

source: les lieux
eo: lokoj

source: les notes
eo: la notoj

source: les étiquettes
eo: la glumarkoj

source: les médias
eo: la aŭdvidaĵoj

source: Où obtenir de l'aide ?
eo: Kie ricevi helpon?

source: la documentation officielle : <https://gramps-project.org/wiki/index.php/Gramps_5.1_Wiki_Manual>
eo: oficiala Dokumentado: <https://gramps-project.org/wiki/index.php/Gramps_5.1_Wiki_Manual>

source: le discourse de gramps : <https://gramps.discourse.group/> \(en anglais\)
eo: gramps Diskurso: <https://gramps.discourse.group/> \(en la angla\)

source: le forum geneanet : <https://www.geneanet.org/forum/viewforum.php?f=55945&sid=de725cd97855d4a68268a420061b629f> \(en français\)
eo: la forumo de geneanet: <https://www.geneanet.org/forum/viewforum.php?f=55945&sid=de725cd97855d4a68268a420061b629f> \(en la franca\)
